package Enum;

public class task1 {
    public static void main(String[] args) {

        System.out.println(Алфавит.порядковыйНомерБуквы(Алфавит.З));
        System.out.println(Алфавит.порядковыйНомерБуквы(Алфавит.Г));
        System.out.println(Алфавит.порядковыйНомерБуквы(Алфавит.Ф));
        System.out.println(Алфавит.порядковыйНомерБуквы(Алфавит.Ю));

    }

    enum Алфавит {
        А(1),
        Б(2),
        В(3),
        Г(4),
        Д(5),
        Е(6),
        Ё(7),
        Ж(8),
        З(9),
        И(10),
        Й(11),
        К(12),
        Л(13),
        М(14),
        Н(15),
        О(16),
        П(17),
        Р(18),
        С(19),
        Т(20),
        У(21),
        Ф(22),
        Х(23),
        Ц(24),
        Ч(25),
        Ш(26),
        Щ(27),
        Ъ(28),
        Ы(29),
        Ь(30),
        Э(31),
        Ю(32),
        Я(33);
        private int index;

        Алфавит(int index) {
            this.index = index;
        }

        public static int порядковыйНомерБуквы(Алфавит буква){
            return буква.index;

        }
    }
}
